Revit 2024 API
CylindricalHelix.XVector Property
The X direction vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ XVector { get; }
Visual Basic
Public ReadOnly Property XVector As XYZ
	Get
Visual C++
public:
property XYZ^ XVector {
	XYZ^ get ();
}
See Also
CylindricalHelix Class
Autodesk.Revit.DB Namespace